In [11]:
import pandas as pd
import numpy as np

In [12]:
df=pd.read_csv('https://raw.githubusercontent.com/jakevdp/PythonDataScienceHandbook/master/notebooks/data/births.csv')

In [3]:
df.head()

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548
4  1969      1  3.0      F    4548

Find the column having float and object value

In [5]:
#Method-1
df.select_dtypes(include=['float64','object'])

       day gender
0      1.0      F
1      1.0      M
2      2.0      F
3      2.0      M
4      3.0      F
...    ...    ...
15542  NaN      M
15543  NaN      F
15544  NaN      M
15545  NaN      F
15546  NaN      M

[15547 rows x 2 columns]

In [ ]:
df[df.columns[df.dtypes=='float64'] | df.columns[df.dtypes=='object']].dropna()

        day gender
0       1.0      F
1       1.0      M
2       2.0      F
3       2.0      M
4       3.0      F
...     ...    ...
15062  29.0      M
15063  30.0      F
15064  30.0      M
15065  31.0      F
15066  31.0      M

[15067 rows x 2 columns]

Number of birth in each year

In [ ]:
#df.groupby('year')['births'].count().reset_index() 
#or 
df['year'].value_counts().reset_index()

    index  year
0    1969   768
1    1970   768
2    1974   766
3    1972   765
4    1971   764
5    1975   763
6    1973   762
7    1976   761
8    1978   761
9    1977   761
10   1983   749
11   1982   748
12   1980   747
13   1984   747
14   1979   747
15   1981   745
16   1988   739
17   1985   737
18   1986   736
19   1987   733
20   2001    24
21   1993    24
22   1994    24
23   2008    24
24   2000    24
25   1992    24
26   2007    24
27   2002    24
28   1995    24
29   1999    24
30   1996    24
31   2004    24
32   1989    24
33   1997    24
34   2005    24
35   1990    24
36   1998    24
37   2006    24
38   1991    24
39   2003    24

In [ ]:
df.groupby('year')['births'].sum().reset_index()

    year   births
0   1969  3600206
1   1970  3737800
2   1971  3563548
3   1972  3266235
4   1973  3146125
5   1974  3170631
6   1975  3153556
7   1976  3176476
8   1977  3332159
9   1978  3338300
10  1979  3499795
11  1980  3617981
12  1981  3635515
13  1982  3685457
14  1983  3642821
15  1984  3673568
16  1985  3765064
17  1986  3760695
18  1987  3813216
19  1988  3913793
20  1989  4045693
21  1990  4162917
22  1991  4115342
23  1992  4069428
24  1993  4004523
25  1994  3956925
26  1995  3903012
27  1996  3894874
28  1997  3884329
29  1998  3945192
30  1999  3963465
31  2000  4063823
32  2001  4031531
33  2002  4027376
34  2003  4096092
35  2004  4118907
36  2005  4145619
37  2006  4273225
38  2007  4324008
39  2008  4255156

In [ ]:
n=3
for i in range(n*n):
  a=int(i/2)
  b=i%2
  print(a,b)

0 0
0 1
1 0
1 1
2 0
2 1
3 0
3 1
4 0

In [20]:
number_str=str()
zero_filled_number = number_str.zfill(2)

In [21]:
a=zero_filled_number+str('1')

In [22]:
b=int(zero_filled_number)+int(1)

In [24]:
a

'001'

**Find anagram from given string**

Two strings are said to be anagram if we can form one string by arranging the characters of another string. For example, Race and Care. Here, we can form Race by arranging the characters of Care

In [27]:
#with counter method work well
from collections import Counter

def implement_anagram(str1,str2):
  str1=str1.lower().replace(" ",'')
  str2=str2.lower().replace(" ",'')

  return Counter(str1)==Counter(str2)

In [28]:
implement_anagram('Nitesh','Pandey')

False

In [ ]:
def anagram_check(str1,str2):
  group_string={}
  for i in str1:
    if i in group_string:
      group_string[i]+=1
    else:
      group_string[i]=1
  
  for i in str1:
    if i in group_string:
      group_string[i]-=1
    else:
      group_string[i]=1
  
  for j in group_string:
    if group_string[j]!=0:
      return False
    else:
      return True

In [ ]:
string1=input('Enter first string:')
string1=string1.replace(" ","").lower()

string2=input('Enter second string:')
string2=string2.replace(" ","").lower()

var=anagram_check(string1,string2)
if (var):
  print('Given string is Anagram')

else:
  print('Given string is not Anagram')

Enter first string:cat0
Enter second string:act0
Given string is Anagram

In [30]:
def without_counter(str1,str2):
  d={}
  c={}
  str1=str1.lower().replace(' ','')
  str2=str2.lower().replace(' ','')
  for i in str1:
    if i in d:
      d[i]+=1
    
    else:
      d[i]=1
  for j in str2:
    if j in c:
      c[j]+=1
    else:
      c[j]=1
  
  if d==c:
    print('Given Sting is Anagram')
  
  else:
    print('Not anagram')

In [32]:
without_counter('cat 1','act0')

Not anagram

In [33]:
#find the number of character in given word without counter method

def without_counter(str1):
  d={}
  for i in str1:
    if i in d:
      d[i]+=1
    
    else:
      d[i]=1
  return d

without_counter('niteshhhh')

{'e': 1, 'h': 4, 'i': 1, 'n': 1, 's': 1, 't': 1}

In [35]:
def append_bit(x,L):
  return [x+element for element in L]

def generate_bits(n):
  if n==0:
    return []
  if n==1:
    return ["0","1"]
  else:
    return (append_bit("0",generate_bits(n-1)) + append_bit("1",generate_bits(n-1)))

In [37]:
out=generate_bits(2)
print(out,end='')

['00', '01', '10', '11']

In [ ]:
MIN=1000;
MAX=9999;
DIGITS=4;

def get_best(prev,curr):
  maximum=max(MIN,prev)
  for i in range(maximum,MAX+1):
    cnt=0
    a=i
    b=curr

    for k in range(DIGITS):
      if a%10!=b%10:
        cnt+=1
      
      a//=10
      b//=10
    if cnt <=1:
      return i
    
  return -1


def getList(arr,n):
  myList=[]
  possible=True
  myList.append(0)

  for i in range(n):
    curr=arr[i]
    myList.append(get_best(myList[-1],curr))

    if (myList[-1]==-1):
      possible=False
      break
  
  if (possible):
    for i in range(1,len(myList)):
      print(myList[i],end=" ")
      

if __name__=="__main__":
  arr=[1099, 1094, 1095,1099,2000,9999,9000,4500]
  n=len(arr)
  getList(arr,n)

1009 1014 1015 1019 2000 2999 3000 3500

100

In [41]:
class Person:
  def __init__(self,name,address,number,course):
    self.name=name
    self.address=address
    self._number=number  #protected variable
    self.__course=course #private variable

  def display(self):
    print(self.name,'\n', self.address,'\n',self._number,'\n',self.__course)

In [42]:
per1=Person('Nitesh','UP',12345,'AI')
per1.display()
#print(per1._number)
#dir(per1)

#print(per1._Person__course)

Nitesh
 UP
 12345
 AI

In [50]:
class freind(Person):
  def __init__(self,fr_name):
    super().__init__('Nitesh','UP',12345,'AI')
    self.fr_name=fr_name

  def display2(self):
    print(self.name,'\n', self.address,'\n',self._number,'\n')

In [51]:
fr=freind('Rohit')

In [52]:
fr.display2()

Nitesh
 UP
 12345